SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_tim.c
    if(TIMx == TIM2)
    {
        TIM_Base_Channel2(TIMx, TIM_TimeBaseInitStruct->CapCh2Sel);
        TIM_Base_Channel3(TIMx, TIM_TimeBaseInitStruct->CapCh3Sel);
        TIM_Base_Channel4(TIMx, TIM_TimeBaseInitStruct->CapCh4Sel);
    }
    else 
    {
        /* none */
    }
}

void TIM_Base_Struct_Initialize(TIM_TimeBaseInitType* TIM_TimeBaseInitStruct)
{
    /* Set the default configuration */
    TIM_TimeBaseInitStruct->Period    = 0xFFFF;
    TIM_TimeBaseInitStruct->Prescaler = 0x0000;
    TIM_TimeBaseInitStruct->ClkDiv    = TIM_CLK_DIV1;
    TIM_TimeBaseInitStruct->CntMode   = TIM_CNT_MODE_UP;
    TIM_TimeBaseInitStruct->RepetCnt  = 0x0000;

    TIM_TimeBaseInitStruct->CapCh1Sel    = false;
    TIM_TimeBaseInitStruct->CapCh2Sel    = false;
    TIM_TimeBaseInitStruct->CapCh3Sel    = false;
    TIM_TimeBaseInitStruct->CapCh4Sel    = false;
    TIM_TimeBaseInitStruct->CapEtrClrFromCompEn = false;
    TIM_TimeBaseInitStruct->CapEtrSelFromTscEn  = false;    
}
/**
*\*\name    TIM_Base_Count_Set.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM6
*\*\          - TIM8
*\*\param   count:
*\*\return  none
**/
void TIM_Base_Count_Set(TIM_Module* TIMx, uint16_t count)
{
    TIMx->CNT= count;
}
/**
*\*\name    TIM_Base_Count_Get.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM6
*\*\          - TIM8
*\*\return  the value of count register
**/
uint16_t TIM_Base_Count_Get(TIM_Module* TIMx)
{
    /* Get the value of count register */
    return TIMx->CNT;
}

/**
*\*\name    TIM_Auto_Reload_Get.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM6
*\*\          - TIM8
*\*\return  the value of auto reload register
**/
uint16_t TIM_Auto_Reload_Get(TIM_Module* TIMx)
{
    /* Get the value of auto reload register */
    return TIMx->AR;
}

/**
*\*\name    TIM_Base_Prescaler_Get.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM6
*\*\          - TIM8
*\*\return  the value of prescaler register
**/
uint16_t TIM_Base_Prescaler_Get(TIM_Module* TIMx)
{
    /* Get the value of prescaler register */
    return TIMx->PSC;
}


/**
*\*\name    TIM_Enable.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM6
*\*\          - TIM8
*\*\return  none
**/
void TIM_On(TIM_Module* TIMx)
{
    TIMx->CTRL1 |= TIM_ON;
}

/**
*\*\name    TIM_Disable.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM6
*\*\          - TIM8
*\*\return  none
**/
void TIM_Off(TIM_Module* TIMx)
{
    TIMx->CTRL1 &= (uint32_t)(~((uint32_t)TIM_ON));
}

/**
*\*\name    TIM_Output_Channel1_Preload_Set
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   TIM_output_channel_preload 
*\*\          - TIM_OC_PRELOAD_ENABLE
*\*\          - TIM_OC_PRELOAD_DISABLE
*\*\return  none
**/
void TIM_Output_Channel1_Preload_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_preload)
{
    uint16_t temp_value = 0;

    temp_value = TIMx->CCMOD1;
    /* Reset the OC1PE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC1_PRELOAD_MASK);
    /* Enable or Disable the Output Compare Preload feat_value |= (uint16_t)TIM_output_channel_preload;*/
    temp_value |= TIM_output_channel_preload;
    /* Write to TIMx CCMOD1 register */
    TIMx->CCMOD1 = temp_value;    
}

/**
*\*\name    TIM_Output_Channel2_Preload_Set
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   TIM_output_channel_preload 
*\*\          - TIM_OC_PRELOAD_ENABLE
*\*\          - TIM_OC_PRELOAD_DISABLE
*\*\return  none
**/
void TIM_Output_Channel2_Preload_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_preload)
{
    uint16_t temp_value = 0;

    temp_value = TIMx->CCMOD1;
    /* Reset the OC1PE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC2_PRELOAD_MASK);
    /* Enable or Disable the Output Compare Preload feature */
    temp_value |= (uint16_t)(TIM_output_channel_preload << 8);
    /* Write to TIMx CCMOD1 register */
    TIMx->CCMOD1 = temp_value;    
}

/**
*\*\name    TIM_Output_Channel3_Preload_Set
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   TIM_output_channel_preload 
*\*\          - TIM_OC_PRELOAD_ENABLE
*\*\          - TIM_OC_PRELOAD_DISABLE
*\*\return  none
**/
void TIM_Output_Channel3_Preload_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_preload)
{
    uint16_t temp_value = 0;

    temp_value = TIMx->CCMOD2;
    /* Reset the OC1PE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC3_PRELOAD_MASK);
    /* Enable or Disable the Output Compare Preload feature */
    temp_value |= TIM_output_channel_preload;
    /* Write to TIMx CCMOD2 register */
    TIMx->CCMOD2 = temp_value;    
}

/**
*\*\name    TIM_Output_Channel4_Preload_Set
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   TIM_output_channel_preload 
*\*\          - TIM_OC_PRELOAD_ENABLE
*\*\          - TIM_OC_PRELOAD_DISABLE
*\*\return  none
**/
void TIM_Output_Channel4_Preload_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_preload)
{
    uint16_t temp_value = 0;

    temp_value = TIMx->CCMOD2;
    /* Reset the OC1PE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC4_PRELOAD_MASK);
    /* Enable or Disable the Output Compare Preload feature */
    temp_value |= (uint16_t)(TIM_output_channel_preload << 8);
    /* Write to TIMx CCMOD2 register */
    TIMx->CCMOD2 = temp_value;    
}

/**
*\*\name    TIM_Output_Channel5_Preload_Set
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM8
*\*\param   TIM_output_channel_preload 
*\*\          - TIM_OC_PRELOAD_ENABLE
*\*\          - TIM_OC_PRELOAD_DISABLE
*\*\return  none
**/
void TIM_Output_Channel5_Preload_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_preload)
{
    uint16_t temp_value = 0;

    temp_value = TIMx->CCMOD3;
    /* Reset the OC1PE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC5_PRELOAD_MASK);
    /* Enable or Disable the Output Compare Preload feature */
    temp_value |= TIM_output_channel_preload;
    /* Write to TIMx CCMOD3 register */
    TIMx->CCMOD3 = temp_value;    
}

/**
*\*\name    TIM_Output_Channel6_Preload_Set
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   TIM_output_channel_preload 
*\*\          - TIM_OC_PRE_LOAD_ENABLE
*\*\          - TIM_OC_PRE_LOAD_DISABLE
*\*\return  none
**/
void TIM_Output_Channel6_Preload_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_preload)
{
    uint16_t temp_value = 0;

    temp_value = TIMx->CCMOD3;
    /* Reset the OC1PE Bit */
    temp_value &= (uint16_t) ~((uint16_t)TIM_OC6_PRELOAD_MASK);
    /* Enable or Disable the Output Compare Preload feature */
    temp_value |=  (uint16_t)(TIM_output_channel_preload << 8);
    /* Write to TIMx CCMOD3 register */
    TIMx->CCMOD3 = temp_value;    
}

/**
*\*\name    TIM_Output_Channel7_Preload_Set
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   TIM_output_channel_preload 
*\*\          - TIM_OC_PRELOAD_ENABLE
*\*\          - TIM_OC_PRELOAD_DISABLE
*\*\return  none
**/
void TIM_Output_Channel7_Preload_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_preload)
{
    if(TIM_OC_PRELOAD_ENABLE == TIM_output_channel_preload)
    {
        TIMx->CCMOD2 |= TIM_OC7_PRELOAD_ENABLE;
    }
    else if(TIM_OC_PRELOAD_DISABLE == TIM_output_channel_preload)
    {
        TIMx->CCMOD2 &= (uint32_t)(~TIM_OC7_PRELOAD_ENABLE);
    }
    else
    {
        /* none */
    }
}

/**
*\*\name    TIM_Output_Channel8_Preload_Set
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   TIM_output_channel_preload 
*\*\          - TIM_OC_PRE_LOAD_ENABLE
*\*\          - TIM_OC_PRE_LOAD_DISABLE
*\*\return  none
**/
void TIM_Output_Channel8_Preload_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_preload)
{
    if(TIM_OC_PRELOAD_ENABLE == TIM_output_channel_preload)
    {
        TIMx->CCMOD2 |= TIM_OC8_PRELOAD_ENABLE;
    }
    else if(TIM_OC_PRELOAD_DISABLE == TIM_output_channel_preload)
    {
        TIMx->CCMOD2 &= (uint32_t)(~TIM_OC8_PRELOAD_ENABLE);
    }
    else
    {
        /* none */
    }
}

/**
*\*\name    TIM_Output_Channel9_Preload_Set
*\*\param   TIMx:
*\*\          - TIM1
*\*\param   TIM_output_channel_preload 
*\*\          - TIM_OC_PRE_LOAD_ENABLE
*\*\          - TIM_OC_PRE_LOAD_DISABLE
*\*\return  none
**/
void TIM_Output_Channel9_Preload_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_preload)
{
    if(TIM_OC_PRELOAD_ENABLE == TIM_output_channel_preload)
    {
        TIMx->CCMOD2 |= TIM_OC9_PRELOAD_ENABLE;
    }
    else if(TIM_OC_PRELOAD_DISABLE == TIM_output_channel_preload)
    {
        TIMx->CCMOD2 &= (uint32_t)(~TIM_OC9_PRELOAD_ENABLE);
    }
    else
    {
        /* none */
    }
}

/**
*\*\name    TIM_Auto_Reload_Preload_Enable
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM6
*\*\          - TIM8
*\*\return  none
**/
void TIM_Auto_Reload_Preload_Enable(TIM_Module* TIMx)
{
    TIMx->CTRL1 |= TIM_AR_PRELOAD_ENABLE;
}

/**
*\*\name    TIM_Auto_Reload_Preload_Disable
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM6
*\*\          - TIM8
*\*\return  none
**/
void TIM_Auto_Reload_Preload_Disable(TIM_Module* TIMx)
{
    TIMx->CTRL1 &= (uint32_t) ~((uint32_t)TIM_AR_PRELOAD_ENABLE);
}


/**
*\*\name    TIM_Update_Event_Enable
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM6
*\*\          - TIM8
*\*\return  none
**/
void TIM_Update_Event_Enable(TIM_Module* TIMx)
{
    TIMx->CTRL1 &= (uint32_t) ~((uint32_t)TIM_UPDATE_EVENT_DISABLE);
}

/**
*\*\name    TIM_Update_Event_Disable
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM6
*\*\          - TIM8
**/
void TIM_Update_Event_Disable(TIM_Module* TIMx)
{
    TIMx->CTRL1 |= TIM_UPDATE_EVENT_DISABLE;
}

/**
*\*\name    TIM_Update_Request_Source_Set
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM6
*\*\          - TIM8
*\*\param   TIM_update_source:
*\*\          - TIM_UPDATE_SRC_REGULAR    Source of update is counter overflow/underflow
*\*\          - TIM_UPDATE_SRC_GLOBAL     Source of update is the counter overflow/underflow
*\*\                                      or the setting of UG bit, or an update generation
*\*\                                      through the slave mode controller.
*\*\note    TIM6 does note support slave mode and underflow counter
*\*\return  none
**/
void TIM_Update_Request_Source_Set(TIM_Module* TIMx, uint16_t TIM_update_source)
{
    if (TIM_update_source != TIM_UPDATE_SRC_GLOBAL)
    {
        /* Set the URS Bit */
        TIMx->CTRL1 |= TIM_UPRS_REGULAR;
    }
    else
    {
        /* Reset the URS Bit */
        TIMx->CTRL1 &= (uint32_t) ~((uint32_t)TIM_UPRS_REGULAR);
    }
}

/**
*\*\fun     Enables or disables the preload register of auto reload register.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM6
*\*\          - TIM8
*\*\param   TIM_event_source 
*\*\          - TIM_EVT_SRC_UPDATE    Timer update Event source
*\*\          - TIM_EVT_SRC_CC1       Timer Capture Compare 1 Event source
*\*\          - TIM_EVT_SRC_CC2       Timer Capture Compare 2 Event source
*\*\          - TIM_EVT_SRC_CC3       Timer Capture Compare 3 Event source
*\*\          - TIM_EVT_SRC_CC4       Timer Capture Compare 4 Event source
*\*\          - TIM_EVT_SRC_COM       Timer COM event source
*\*\          - TIM_EVT_SRC_TRIG      Timer Trigger Event source
*\*\          - TIM_EVT_SRC_BREAK     Timer Break event source
*\*\return  none
*\*\note    TIM6 and TIM7 can only generate an update event. 
*\*\     TIM_EVT_SRC_COM and TIM_EVT_SRC_BREAK are used only with TIM1 and TIM8.
**/
void TIM_Event_Generate(TIM_Module* TIMx, uint16_t TIM_event_source)
{
    TIMx->EVTGEN = TIM_event_source;
}

/**
*\*\name    TIM_Commutation_Event_Enable
*\*\fun     Enables the preload register of auto reload register.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM8
*\*\return  none
**/
void TIM_Commutation_Event_Enable(TIM_Module* TIMx)
{
    TIMx->CTRL2 |= TIM_CCUSEL_COM_AND_TRIG;
}

/**
*\*\name    TIM_Commutation_Event_Disable
*\*\fun     Disables the preload register of auto reload register.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM8
*\*\return  none
**/
void TIM_Commutation_Event_Disable(TIM_Module* TIMx)
{
    TIMx->CTRL2 &= (uint32_t) ~((uint32_t)TIM_CCUSEL_MASK);
}

/**
*\*\name    TIM_Capture_Compare_Control_Preload_Enable
*\*\fun     Disables the preload register of auto reload register.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM8
**/
void TIM_Capture_Compare_Control_Preload_Enable(TIM_Module* TIMx)
{
    TIMx->CTRL2 |= TIM_CCPCTL_PRELOAD;
}

/**
*\*\name    TIM_Capture_Compare_Control_Preload_Disable
*\*\fun     Disables the preload register of auto reload register.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM8
**/
void TIM_Capture_Compare_Control_Preload_Disable(TIM_Module* TIMx)
{
    TIMx->CTRL2 &= (uint32_t) ~((uint32_t)TIM_CCPCTL_PRELOAD);
}

/**
*\*\name    TIM_Compare1_Set
*\*\fun     Sets the TIMx Capture compare1 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   compare1:
*\*\          - [0,0xffff]
**/
void TIM_Compare1_Set(TIM_Module* TIMx, uint16_t compare1)
{
    uint32_t temp_value = TIMx->CCDAT1;
    temp_value &= (uint32_t)(~TIM_CCDAT1_MASK);
    temp_value |= compare1;
    TIMx->CCDAT1 = temp_value;
}

/**
*\*\name    TIM_Compare2_Set
*\*\fun     Sets the TIMx Capture compare2 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   compare2:
*\*\          - [0,0xffff]
**/
void TIM_Compare2_Set(TIM_Module* TIMx, uint16_t compare2)
{
    uint32_t temp_value = TIMx->CCDAT2;
    temp_value &= (uint32_t)(~TIM_CCDAT2_MASK);
    temp_value |= compare2;
    TIMx->CCDAT2 = temp_value;
}

/**
*\*\name    TIM_Compare3_Set
*\*\fun     Sets the TIMx Capture compare3 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   compare3:
*\*\          - [0,0xffff]
**/
void TIM_Compare3_Set(TIM_Module* TIMx, uint16_t compare3)
{
    uint32_t temp_value = TIMx->CCDAT3;
    temp_value &= (uint32_t)(~TIM_CCDAT3_MASK);
    temp_value |= compare3;
    TIMx->CCDAT3 = temp_value;
}

/**
*\*\name    TIM_Compare4_Set
*\*\fun     Sets the TIMx Capture compare4 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   compare4:
*\*\          - [0,0xffff]
**/
void TIM_Compare4_Set(TIM_Module* TIMx, uint16_t compare4)
{
    uint32_t temp_value = TIMx->CCDAT4;
    temp_value &= (uint32_t)(~TIM_CCDAT4_MASK);
    temp_value |= compare4;
    TIMx->CCDAT4 = temp_value;
}

/**
*\*\name    TIM_Compare5_Set
*\*\fun     Sets the TIMx Capture compare5 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM8
*\*\param   compare5:
*\*\          - [0,0xffff]
**/
void TIM_Compare5_Set(TIM_Module* TIMx, uint16_t compare5)
{
    TIMx->CCDAT5 = compare5;  
}

/**
*\*\name    TIM_Compare6_Set
*\*\fun     Sets the TIMx Capture compare6 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM8
*\*\param   compare6:
*\*\          - [0,0xffff]
**/
void TIM_Compare6_Set(TIM_Module* TIMx, uint16_t compare6)
{
    TIMx->CCDAT6 = compare6;
}

/**
*\*\name    TIM_Compare7_Set
*\*\fun     Sets the TIMx Capture compare7 Register value
*\*\param   TIMx
*\*\          - TIM1
*\*\param   compare7:
*\*\          - [0,0xffff]
*\*\return  none
*\*\note    only for TIM1
**/
void TIM_Compare7_Set(TIM_Module* TIMx, uint16_t compare7)
{
    TIMx->CCDAT7 = compare7;
}

/**
*\*\name    TIM_Compare8_Set
*\*\fun     Sets the TIMx Capture compare8 Register value
*\*\param   TIMx
*\*\          - TIM1
*\*\param   compare8:
*\*\          - [0,0xffff]
*\*\return  none
*\*\note    only for TIM1
**/
void TIM_Compare8_Set(TIM_Module* TIMx, uint16_t compare8)
{
    TIMx->CCDAT8 = compare8;
}

/**
*\*\name    TIM_Compare9_Set
*\*\fun     Sets the TIMx Capture compare9 Register value
*\*\param   TIMx
*\*\          - TIM1
*\*\param   compare9:
*\*\          - [0,0xffff]
*\*\return  none
*\*\note    only for TIM1
**/
void TIM_Compare9_Set(TIM_Module* TIMx, uint16_t compare9)
{
    TIMx->CCDAT9 = compare9;
}

/**
*\*\name    TIM_Compare1_D_Set
*\*\fun     Sets the CCDDAT1[16:31] in TIM1_CCDAT1 register
*\*\param   TIMx
*\*\          - TIM1
*\*\param   compare1:
*\*\          - [0,0xffff]
*\*\return  none
*\*\note    only for TIM1
**/
void TIM_Compare1_D_Set(TIM_Module* TIMx, uint16_t compare1)
{
    uint32_t temp_value = TIMx->CCDAT1;
    temp_value &= (uint32_t)(~TIM_CCDDAT1_MASK);
    temp_value |= (((uint32_t)compare1) << TIM_CCDDAT1_OFFSET);
    TIMx->CCDAT1 = temp_value;
}

/**
*\*\name    TIM_Compare2_D_Set
*\*\fun     Sets the CCDDAT2[16:31] in TIM1_CCDAT2 register
*\*\param   TIMx
*\*\          - TIM1
*\*\param   compare2:
*\*\          - [0,0xffff]
*\*\return  none
*\*\note    only for TIM1
**/
void TIM_Compare2_D_Set(TIM_Module* TIMx, uint16_t compare2)
{
    uint32_t temp_value = TIMx->CCDAT2;
    temp_value &= (uint32_t)(~TIM_CCDDAT2_MASK);
    temp_value |= (((uint32_t)compare2) << TIM_CCDDAT2_OFFSET);
    TIMx->CCDAT2 = temp_value;
}

/**
*\*\name    TIM_Compare3_D_Set
*\*\fun     Sets the CCDDAT3[16:31] in TIM1_CCDAT3 register
*\*\param   TIMx
*\*\          - TIM1
*\*\param   compare3:
*\*\          - [0,0xffff]
*\*\return  none
*\*\note    only for TIM1
**/
void TIM_Compare3_D_Set(TIM_Module* TIMx, uint16_t compare3)
{
    uint32_t temp_value = TIMx->CCDAT3;
    temp_value &= (uint32_t)(~TIM_CCDDAT3_MASK);
    temp_value |= (((uint32_t)compare3) << TIM_CCDDAT3_OFFSET);
    TIMx->CCDAT3 = temp_value;
}

/**
*\*\name    TIM_Compare4_D_Set
*\*\fun     Sets the CCDDAT4[16:31] in TIM1_CCDAT4 register
*\*\param   TIMx
*\*\          - TIM1
*\*\param   compare4:
*\*\          - [0,0xffff]
*\*\return  none
*\*\note    only for TIM1
**/
void TIM_Compare4_D_Set(TIM_Module* TIMx, uint16_t compare4)
{
    uint32_t temp_value = TIMx->CCDAT4;
    temp_value &= (uint32_t)(~TIM_CCDDAT4_MASK);
    temp_value |= (((uint32_t)compare4) << TIM_CCDDAT4_OFFSET);
    TIMx->CCDAT4 = temp_value;
}

/**
*\*\name    TIM_Compare_Capture1_Get 
*\*\fun     Get the TIMx compare1 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\return  uin16_t:
*\*\          - [0 , 0xffff]
**/
uint16_t TIM_Compare_Capture1_Get(TIM_Module* TIMx)
{
    return (uint16_t)(TIMx->CCDAT1);
}

/**
*\*\name    TIM_Compare_Capture2_Get 
*\*\fun     Get the TIMx Compare2 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\return  uin16_t:
*\*\          - [0 , 0xffff]
**/
uint16_t TIM_Compare_Capture2_Get(TIM_Module* TIMx)
{
    return (uint16_t)(TIMx->CCDAT2);
}

/**
*\*\name    TIM_Compare_Capture3_Get 
*\*\fun     Get the TIMx Compare3 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\return  uin16_t:
*\*\          - [0 , 0xffff]
**/
uint16_t TIM_Compare_Capture3_Get(TIM_Module* TIMx)
{
    return (uint16_t)(TIMx->CCDAT3);
}

/**
*\*\name    TIM_Compare_Capture4_Get 
*\*\fun     Get the TIMx Compare4 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\return  uin16_t:
*\*\          - [0 , 0xffff]
**/
uint16_t TIM_Compare_Capture4_Get(TIM_Module* TIMx)
{
    return (uint16_t)(TIMx->CCDAT4);
}

/**
*\*\name    TIM_Compare_Capture5_Get 
*\*\fun     Get the TIMx Compare5 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM8
*\*\return  uin16_t:
*\*\          - [0 , 0xffff]
**/
uint16_t TIM_Compare_Capture5_Get(TIM_Module* TIMx)
{
    return TIMx->CCDAT5;
}

/**
*\*\name    TIM_Compare_Capture6_Get
*\*\fun     Get the TIMx Compare6 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM8
*\*\return  uin16_t:
*\*\          - [0 , 0xffff]
**/
uint16_t TIM_Compare_Capture6_Get(TIM_Module* TIMx)
{
    return TIMx->CCDAT6;
}

/**
*\*\name    TIM_Compare_Capture7_Get
*\*\fun     Sets the TIMx Capture compare7 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\return  uint16_t:
*\*\          - [0 , 0xffff]         
*\*\note    only for TIM1
**/
uint16_t TIM_Compare_Capture7_Get(TIM_Module* TIMx)
{
    return TIMx->CCDAT7;
}

/**
*\*\name    TIM_Compare_Capture8_Get
*\*\fun     Sets the TIMx Capture compare8 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\return  uint16_t:
*\*\          - [0 , 0xffff]         
*\*\note    only for TIM1
**/
uint16_t TIM_Compare_Capture8_Get(TIM_Module* TIMx)
{
    return TIMx->CCDAT8;
}

/**
*\*\name    TIM_Compare_Capture9_Get
*\*\fun     Sets the TIMx Capture compare9 Register value
*\*\param   TIMx:
*\*\          - TIM1
*\*\return  uint16_t:
*\*\          - [0 , 0xffff]         
*\*\note    only for TIM1
**/
uint16_t TIM_Compare_Capture9_Get(TIM_Module* TIMx)
{
    return TIMx->CCDAT9;
}

/**
*\*\name    TIM_Compare_Capture1_D_Get
*\*\fun     Gets the CCDDAT1[16:31] in TIMx_CCDAT1 register
*\*\param   TIMx：
*\*\          - TIM1
*\*\return  uint16_t:
*\*\          - [0 , 0xffff]         
*\*\note    only for TIM1
**/
uint16_t TIM_Compare_Capture1_D_Get(TIM_Module* TIMx)
{
    return (uint16_t)((TIMx->CCDAT1 & TIM_CCDDAT1_MASK) >> 16);
}

/**
*\*\name    TIM_Compare_Capture2_D_Get
*\*\fun     Gets the CCDDAT2[16:31] in TIMx_CCDAT2 register
*\*\param   TIMx：
*\*\          - TIM1
*\*\return  uint16_t:
*\*\          - [0 , 0xffff]         
*\*\note    only for TIM1
**/
uint16_t TIM_Compare_Capture2_D_Get(TIM_Module* TIMx)
{
    return (uint16_t)((TIMx->CCDAT2 & TIM_CCDDAT2_MASK) >> 16);
}

/**
*\*\name    TIM_Compare_Capture3_D_Get
*\*\fun     Gets the CCDDAT3[16:31] in TIMx_CCDAT3 register
*\*\param   TIMx：
*\*\          - TIM1
*\*\return  uint16_t:
*\*\          - [0 , 0xffff]         
*\*\note    only for TIM1
**/
uint16_t TIM_Compare_Capture3_D_Get(TIM_Module* TIMx)
{
    return (uint16_t)((TIMx->CCDAT3 & TIM_CCDDAT3_MASK) >> 16);
}

/**
*\*\name    TIM_Compare_Capture4_D_Get
*\*\fun     Gets the CCDDAT4[16:31] in TIMx_CCDAT4 register
*\*\param   TIMx：
*\*\          - TIM1
*\*\return  uint16_t:
*\*\          - [0 , 0xffff]         
*\*\note    only for TIM1
**/
uint16_t TIM_Compare_Capture4_D_Get(TIM_Module* TIMx)
{
    return (uint16_t)((TIMx->CCDAT4 & TIM_CCDDAT4_MASK) >> 16);
}


