SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_tim.c
    TIM_External_Trigger_Filter_Set(TIMx, external_trigger_filter);
    TIM_External_Trigger_Polarity_Set(TIMx, external_trigger_polarity);
    TIM_External_Trigger_Prescaler_Set(TIMx, external_trigger_prescaler);

    /* Get the TIMx SMCTRL register value */
    temp_value = TIMx->SMCTRL;
    /* Reset the SMS Bits */
    temp_value &= (uint16_t)(~((uint16_t)TIM_SLAVE_MODE_MASK));
    /* Select the External clock mode1 */
    temp_value |= TIM_SLAVE_MODE_EXT1;
    /* Select the Trigger selection : ETRF */
    temp_value &= (uint16_t)(~((uint16_t)TIM_TRIG_SEL_MASK));
    temp_value |= TIM_TRIG_SEL_ETRF;
    /* Write to TIMx SMCTRL */
    TIMx->SMCTRL = temp_value;
}

/**
*\*\name    TIM_ConfigExtClkMode2.
*\*\fun     Configures the External clock Mode1
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   external_trigger_prescaler
*\*\          - TIM_EXT_TRG_PSC_OFF ETRP Prescaler OFF.
*\*\          - TIM_EXT_TRG_PSC_DIV2 ETRP frequency divided by 2.
*\*\          - TIM_EXT_TRG_PSC_DIV4 ETRP frequency divided by 4.
*\*\          - TIM_EXT_TRG_PSC_DIV8 ETRP frequency divided by 8.
 * @param external_trigger_polarity The external Trigger Polarity.
*\*\          - TIM_EXT_TRIG_POLARITY_INVERTED active low or falling edge active.
*\*\          - TIM_EXT_TRIG_POLARITY_NONINVERTED active high or rising edge active.
*\*\param   external_trigger_filter 
*\*\          - [0x0 0xF]
*\*\return  none
**/
void TIM_External_Clock_Mode2_Set(TIM_Module* TIMx,
                                  uint16_t external_trigger_prescaler,
                                  uint16_t external_trigger_polarity,
                                  uint16_t external_trigger_filter)
{
    TIM_External_Trigger_Filter_Set(TIMx, external_trigger_filter);

    TIM_External_Trigger_Polarity_Set(TIMx, external_trigger_polarity);

    TIM_External_Trigger_Prescaler_Set(TIMx, external_trigger_prescaler);

    TIMx->SMCTRL |= TIM_EXT_CLOCK_MODE2_ENABLE;

}

/**
*\*\name    TIM_Slave_Mode_Select.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   TIM_slave_mode:
*\*\          - TIM_SLAVE_MODE_RESET    Rising edge of the selected trigger signal (TRGI) re-initializes
*\*\                                    the counter and triggers an update of the registers.
*\*\          - TIM_SLAVE_MODE_GATED    The counter clock is enabled when the trigger signal (TRGI) is high.
*\*\          - TIM_SLAVE_MODE_TRIG     The counter starts at a rising edge of the trigger TRGI.
*\*\          - TIM_SLAVE_MODE_EXT1     Rising edges of the selected trigger (TRGI) clock the counter.
*\*\return  none
**/
void TIM_Slave_Mode_Select(TIM_Module* TIMx, uint16_t TIM_slave_mode)
{
    /* Reset the SMS Bits */
    TIMx->SMCTRL &= (uint16_t) ~((uint16_t)TIM_SLAVE_MODE_MASK);
    /* Select the Slave Mode */
    TIMx->SMCTRL |= TIM_slave_mode;
}

/**
*\*\name    TIM_Break_And_Dead_Time_Set.
*\*\fun     Initializes the TIM break and dead time register
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   TIM_slave_mode:
*\*\          - TIM_MASTER_SLAVE_MODE_ENABLE    synchronization between the current timer
*\*\                                            and its slaves (through TRGO).
*\*\          - TIM_MASTER_SLAVE_MODE_DISABLE   No action
*\*\return  none
**/
void TIM_Master_Slave_Mode_Set(TIM_Module* TIMx, uint16_t TIM_master_slave_mode)
{
    /* Reset the MSM Bit */
    TIMx->SMCTRL &= (uint16_t) ~((uint16_t)TIM_MASTER_SLAVE_MODE_MASK);

    /* Set or Reset the MSM Bit */
    TIMx->SMCTRL |= TIM_master_slave_mode;
}



/**
*\*\name    TIM_Output_Trigger_Select.
*\*\fun     Initializes the TIM break and dead time register
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM6
*\*\          - TIM8
*\*\param   TIM_TRGOSource
*\*\          For all TIMx:
*\*\          - TIM_TRGO_SRC_RESET           The UG bit in the TIM_EVTGEN register is used as the trigger output (TRGO).
*\*\          - TIM_TRGO_SRC_ENABLE          The Counter Enable CEN is used as the trigger output (TRGO).
*\*\          - TIM_TRGO_SRC_UPDATE          The update event is selected as the trigger output (TRGO).
*\*\          For all TIMx except TIM6:
*\*\          - TIM_TRGO_SRC_OC1             The trigger output sends a positive pulse when the CC1IF flag
*\*\                                         is to be set, as soon as a capture or compare match occurs (TRGO).
*\*\          - TIM_TRGO_SRC_OC1REF          OC1REF signal is used as the trigger output (TRGO).
*\*\          - TIM_TRGO_SRC_OC2REF          OC2REF signal is used as the trigger output (TRGO).
*\*\          - TIM_TRGO_SRC_OC3REF          OC3REF signal is used as the trigger output (TRGO).
*\*\          - TIM_TRGO_SRC_OC4REF          OC4REF signal is used as the trigger output (TRGO).
*\*\          For TIM1：
*\*\          - TIM_TRGO_SRC_OC4_7_8_9REF    OC4REF signal is used as the trigger output (TRGO).
*\*\return  none
**/
void TIM_Output_Trigger_Select(TIM_Module* TIMx, uint16_t TIM_trigger_output_source)
{
    /* Reset the MMS Bits */
    TIMx->CTRL2 &= (uint32_t) ~((uint32_t)TIM_TRGO_SRC_MASK);
    /* Select the TRGO source */
    TIMx->CTRL2 |= TIM_trigger_output_source;
}


/**
*\*\name    TIM_OC4REF_Trigger_To_ADC_Enable
*\*\param   TIMx:
*\*\          - TIM1
*\*\return  none
**/
void TIM_OC4REF_Trigger_To_ADC_Enable(TIM_Module* TIMx)
{
    TIMx->CTRL2 |= TIM_OCREF4_TRIGGER_TO_ADC_ENABLE;
}

/**
*\*\name    TIM_OC4REF_Trigger_To_ADC_Disable
*\*\param   TIMx:
*\*\          - TIM1
*\*\return  none
**/
void TIM_OC4REF_Trigger_To_ADC_Disable(TIM_Module* TIMx)
{
    TIMx->CTRL2 &= (uint32_t)(~TIM_OCREF4_TRIGGER_TO_ADC_ENABLE);
}


/**
*\*\name    TIM_OC7REF_Trigger_To_ADC_Enable
*\*\param   TIMx:
*\*\          - TIM1
*\*\return  none
**/
void TIM_OC7REF_Trigger_To_ADC_Enable(TIM_Module* TIMx)
{
    TIMx->CTRL2 |= TIM_OCREF7_TRIGGER_TO_ADC_ENABLE;
}

/**
*\*\name    TIM_OC7REF_Trigger_To_ADC_Disable
*\*\param   TIMx:
*\*\          - TIM1
*\*\return  none
**/
void TIM_OC7REF_Trigger_To_ADC_Disable(TIM_Module* TIMx)
{
    TIMx->CTRL2 &= (uint32_t)(~TIM_OCREF7_TRIGGER_TO_ADC_ENABLE);
}


/**
*\*\name    TIM_OC8REF_Trigger_To_ADC_Enable
*\*\param   TIMx:
*\*\          - TIM1
*\*\return  none
**/
void TIM_OC8REF_Trigger_To_ADC_Enable(TIM_Module* TIMx)
{
    TIMx->CTRL2 |= TIM_OCREF8_TRIGGER_TO_ADC_ENABLE;
}

/**
*\*\name    TIM_OC8REF_Trigger_To_ADC_Disable
*\*\param   TIMx:
*\*\          - TIM1
*\*\return  none
**/
void TIM_OC8REF_Trigger_To_ADC_Disable(TIM_Module* TIMx)
{
    TIMx->CTRL2 &= (uint32_t)(~TIM_OCREF8_TRIGGER_TO_ADC_ENABLE);
}


/**
*\*\name    TIM_OC9REF_Trigger_To_ADC_Enable
*\*\param   TIMx:
*\*\          - TIM1
*\*\return  none
**/
void TIM_OC9REF_Trigger_To_ADC_Enable(TIM_Module* TIMx)
{
    TIMx->CTRL2 |= TIM_OCREF9_TRIGGER_TO_ADC_ENABLE;
}

/**
*\*\name    TIM_OC9REF_Trigger_To_ADC_Disable
*\*\param   TIMx:
*\*\          - TIM1
*\*\return  none
**/
void TIM_OC9REF_Trigger_To_ADC_Disable(TIM_Module* TIMx)
{
    TIMx->CTRL2 &= (uint32_t)(~TIM_OCREF9_TRIGGER_TO_ADC_ENABLE);
}



/**
*\*\name    TIM_One_Pulse_Mode_Select.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   TIM_slave_mode:
*\*\          - TIM_OPMODE_SINGLE
*\*\          - TIM_OPMODE_REPET
*\*\return  none
**/
void TIM_One_Pulse_Mode_Select(TIM_Module* TIMx, uint16_t TIM_one_pulse_mode)
{
    /* Reset the OPM Bit */
    TIMx->CTRL1 &= (uint32_t) ~((uint32_t)TIM_OPMODE_MASK);
    /* Configure the OPM Mode */
    TIMx->CTRL1 |= TIM_one_pulse_mode;    
}

/**
*\*name TIM_Input_Struct_Initialize
*\*\fun     Initialize the TIM_ICInitStruct
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   TIM_ICInitStruct 
*\*\          - refer to the definition of TIM_ICInitType
*\*\return  none
**/
void TIM_Input_Struct_Initialize(TIM_ICInitType* TIM_ICInitStruct)
{
    /* Set the default configuration */
    TIM_ICInitStruct->IcPolarity  = TIM_IC_POLARITY_RISING;
    TIM_ICInitStruct->IcSelection = TIM_IC_SELECTION_DIRECTTI;
    TIM_ICInitStruct->IcPrescaler = TIM_IC_PSC_DIV1;
    TIM_ICInitStruct->IcFilter    = 0x00;    
}

/**
*\*\name    TIM_Input_Channel_Initialize
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   TIM_ICInitStruct 
*\*           - refer to the definition of TIM_ICInitType
*\*\return  none
**/
void TIM_Input_Channel_Initialize(TIM_Module* TIMx, TIM_ICInitType* TIM_ICInitStruct)
{
    if (TIM_ICInitStruct->Channel == TIM_CH_1)
    {
        /* TI1 Configuration */
        Input_Channel1_Config(TIMx, TIM_ICInitStruct->IcPolarity, TIM_ICInitStruct->IcSelection, TIM_ICInitStruct->IcFilter);
        /* Set the Input Capture Prescaler value */
        TIM_Input_Capture1_Prescaler_Set(TIMx, TIM_ICInitStruct->IcPrescaler);
    }
    else if (TIM_ICInitStruct->Channel == TIM_CH_2)
    {
        /* TI2 Configuration */
        Input_Channel2_Config(TIMx, TIM_ICInitStruct->IcPolarity, TIM_ICInitStruct->IcSelection, TIM_ICInitStruct->IcFilter);
        /* Set the Input Capture Prescaler value */
        TIM_Input_Capture2_Prescaler_Set(TIMx, TIM_ICInitStruct->IcPrescaler);
    }
    else if (TIM_ICInitStruct->Channel == TIM_CH_3)
    {
        /* TI3 Configuration */
        Input_Channel3_Config(TIMx, TIM_ICInitStruct->IcPolarity, TIM_ICInitStruct->IcSelection, TIM_ICInitStruct->IcFilter);
        /* Set the Input Capture Prescaler value */
        TIM_Input_Capture3_Prescaler_Set(TIMx, TIM_ICInitStruct->IcPrescaler);
    }
    else
    {
        /* TI4 Configuration */
        Input_Channel4_Config(TIMx, TIM_ICInitStruct->IcPolarity, TIM_ICInitStruct->IcSelection, TIM_ICInitStruct->IcFilter);
        /* Set the Input Capture Prescaler value */
        TIM_Input_Capture4_Prescaler_Set(TIMx, TIM_ICInitStruct->IcPrescaler);
    }
}


/**
*\*\name    TIM_PWM_Input_Channel_Operation
*\*\fun     Configures the TIM peripheral according to the specified
 *          parameters in the TIM_ICInitStruct to measure an external PWM signal.
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   TIM_ICInitStruct 
*\*           - refer to the definition of TIM_ICInitType
*\*\return  none
**/
void TIM_PWM_Input_Channel_Config(TIM_Module* TIMx, TIM_ICInitType* TIM_ICInitStruct)
{
    uint16_t input_channel_opposite_polarity  = TIM_IC_POLARITY_RISING;
    uint16_t input_channel_opposite_selection = TIM_IC_SELECTION_DIRECTTI;
    /* Select the Opposite Input Polarity */
    if (TIM_ICInitStruct->IcPolarity == TIM_IC_POLARITY_RISING)
    {
        input_channel_opposite_polarity = TIM_IC_POLARITY_FALLING;
    }
    else
    {
        input_channel_opposite_polarity = TIM_IC_POLARITY_RISING;
    }
    /* Select the Opposite Input */
    if (TIM_ICInitStruct->IcSelection == TIM_IC_SELECTION_DIRECTTI)
    {
        input_channel_opposite_selection = TIM_IC_SELECTION_INDIRECTTI;
    }
    else
    {
        input_channel_opposite_selection = TIM_IC_SELECTION_DIRECTTI;
    }
    if (TIM_ICInitStruct->Channel == TIM_CH_1)
    {
        /* TI1 Configuration */
        Input_Channel1_Config(TIMx, TIM_ICInitStruct->IcPolarity, TIM_ICInitStruct->IcSelection, TIM_ICInitStruct->IcFilter);
        /* Set the Input Capture Prescaler value */
        TIM_Input_Capture1_Prescaler_Set(TIMx, TIM_ICInitStruct->IcPrescaler);
        /* TI2 Configuration */
        Input_Channel2_Config(TIMx, input_channel_opposite_polarity, input_channel_opposite_selection, TIM_ICInitStruct->IcFilter);
        /* Set the Input Capture Prescaler value */
        TIM_Input_Capture2_Prescaler_Set(TIMx, TIM_ICInitStruct->IcPrescaler);
    }
    else
    {
        /* TI2 Configuration */
        Input_Channel2_Config(TIMx, TIM_ICInitStruct->IcPolarity, TIM_ICInitStruct->IcSelection, TIM_ICInitStruct->IcFilter);
        /* Set the Input Capture Prescaler value */
        TIM_Input_Capture2_Prescaler_Set(TIMx, TIM_ICInitStruct->IcPrescaler);
        /* TI1 Configuration */
        Input_Channel1_Config(TIMx, input_channel_opposite_polarity, input_channel_opposite_selection, TIM_ICInitStruct->IcFilter);
        /* Set the Input Capture Prescaler value */
        TIM_Input_Capture1_Prescaler_Set(TIMx, TIM_ICInitStruct->IcPrescaler);
    }
}



/**
*\*\name    TIM_Output_Channel_Polarity_Set.
*\*\fun     set the polarity of TIMx channel
*\*\param   TIMx:
*\*\          - TIM1
*\*\          - TIM2
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM5
*\*\          - TIM8
*\*\param   output_channel_polarity:
**\           - TIM_OC_POLARITY_LOW
**\           - TIM_OC_POLARITY_HIGH
*\*\param   channel:
**\           - TIM_CH_1
**\           - TIM_CH_2
**\           - TIM_CH_3
**\           - TIM_CH_4
**\           - TIM_CH_5
**\           - TIM_CH_6
*\*\return  none
*\*\note    - TIM2 TIM3 TIM4 TIM5 does not support channel 5 and channel 6
**/
void TIM_Output_Channel_Polarity_Set(TIM_Module* TIMx, uint32_t output_channel_polarity, uint16_t channel)
{
    uint32_t temp_value = TIMx->CCEN;
    /* Clear the CCxEN bit */
    temp_value &= (uint32_t)(~(uint32_t)(TIM_OC_POLARITY_MASK << channel));

    /* Set the CCxEN bit */
    temp_value |= (uint32_t)(output_channel_polarity << channel);

